In [1]:
import pandas as pd

1. Create a Pandas DataFrame with the following data:

In [2]:
data = pd.DataFrame({
    'Name': ['Alice', 'Bob', 'Carol', 'David', 'Eve'],
    'Age': [20, 22, 19, 21, 20],
    'Gender': ['Female', 'Male', 'Female', 'Male', 'Female'],
    'Marks': [85, 78, 92, 74, 88]
})

2. Write a Python program to:

A. Display the first two rows of the DataFrame.

In [3]:
data.head(2)

    Name  Age  Gender  Marks
0  Alice   20  Female     85
1    Bob   22    Male     78

B. Display the column names, data types, and summary statistics.

In [5]:
print(data.columns.tolist())
print(data.dtypes)
print("\nSummary Statistics:")
print(data.describe())

['Name', 'Age', 'Gender', 'Marks']
Name      object
Age        int64
Gender    object
Marks      int64
dtype: object

Summary Statistics:
             Age      Marks
count   5.000000   5.000000
mean   20.400000  83.400000
std     1.140175   7.334848
min    19.000000  74.000000
25%    20.000000  78.000000
50%    20.000000  85.000000
75%    21.000000  88.000000
max    22.000000  92.000000

C. Add a new column Passed that contains True if Marks >= 80
and False otherwise.

In [8]:
data['Passed'] = data['Marks'] >= 80

In [7]:
data

    Name  Age  Gender  Marks  Passed
0  Alice   20  Female     85    True
1    Bob   22    Male     78   False
2  Carol   19  Female     92    True
3  David   21    Male     74   False
4    Eve   20  Female     88    True